-- HACK: snacks.nvim
return {
  "folke/snacks.nvim",
  priority = 1000,
  lazy = false,
  --@type snacks.Config
  opts = {
    bigfile = { enabled = true },
    dashboard = {
      enabled = true,
      preset = {
        header = [[
██╗   ██╗██╗███╗   ███╗███████╗ ██████╗ ██████╗  ██████╗  ██████╗  ██████╗ ██████╗ 
██║   ██║██║████╗ ████║██╔════╝██╔═══██╗██╔══██╗██╔════╝ ██╔═══██╗██╔═══██╗██╔══██╗
██║   ██║██║██╔████╔██║█████╗  ██║   ██║██████╔╝██║  ███╗██║   ██║██║   ██║██║  ██║
╚██╗ ██╔╝██║██║╚██╔╝██║██╔══╝  ██║   ██║██╔══██╗██║   ██║██║   ██║██║   ██║██║  ██║
 ╚████╔╝ ██║██║ ╚═╝ ██║██║     ╚██████╔╝██║  ██║╚██████╔╝╚██████╔╝╚██████╔╝██████╔╝
  ╚═══╝  ╚═╝╚═╝     ╚═╝╚═╝      ╚═════╝ ╚═╝  ╚═╝ ╚═════╝  ╚═════╝  ╚═════╝ ╚═════╝ 
          ]],
      },
    },
    explorer = {
      enabled = true,
      replace_netrw = true,
    },
    image = { -- HACK: Forcefully disable image preview in snacks.nvim.
      enabled = false,
      formats = {},
    },
    indent = { enable = true },
    quickfile = { enabled = true, exclude = { "latex" } },
    statuscolumn = { enabled = true },
  },
  keys = {
    -- Keymaps for snacks.explorer
    {
      "<leader>te",
      function() Snacks.explorer.open() end,
      desc = "[T]oggle File [E]xplorer",
    },
  },
}
